

[
  {
    "date": "Saturday, 25 Oct 2025",
    "imgSrc": "/img/Day.jpg",
    "title": "Crack Any Competitive Exam",
    "description": "Smart Study Strategies that actually work with tests and tips for scoring high."
  },
  {
    "date": "Saturday, 25 Oct 2025",
    "imgSrc": "/img/Day1.jpg",
    "title": "Top 10 Mistakes Every Aspirant Makes",
    "description": "Don't let common exam errors ruin your success. Preparation blunders and how you can fix them easily."
  },
  {
    "date": "Saturday, 25 Oct 2025",
    "imgSrc": "/img/Day2.jpg",
    "title": "Latest Government Exam Calendar 2025",
    "description": "Stay updated with the complete list of upcoming exams, dates, and deadlines for UPSC, SSC, Railway and more."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day3.jpg",
    "title": "Daily Current Affairs for All Competitive Exams",
    "description": "Daily updated current affairs specially curated for UPSC, SSC, Banking, SSC, Railway and other exams."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day4.jpg",
    "title": "UPSC vs State PSC: Which Exam Should You Choose in 2025?",
    "description": "Expert advice on whether UPSC or state exams should be your focus."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day5.jpg",
    "title": "How to Create a 90-Day Study Plan for Any Competitive Exam",
    "description": "Step-by-step guidance to ensure you use your time effectively to cover all syllabus points and maximize your score."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day6.jpg",
    "title": "The Ultimate List of Free Study Materials & Practice Papers (2025 Update)",
    "description": "All the necessary materials and solved question papers, tailored to your preparation — absolutely free."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day7.jpg",
    "title": "Best Online Courses for Competitive Exams",
    "description": "Top-rated courses from experts for UPSC, SSC, Banking, and State PSC exams. Free trials and discounts included."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day8.jpg",
    "title": "Time Table for Working Aspirants: Study Smart with Limited Hours",
    "description": "Effective strategies for smart studying. Tips provided to enable better work-life balance and exam performance."
  },
  {
    "date": "Friday, 24 Oct 2025",
    "imgSrc": "/img/Day9.jpg",
    "title": "Mindset of a Topper: Secrets Behind Consistent Success in Exams",
    "description": "Develop the mental agility required for successful exam preparation. Includes a discipline, rest, and motivation framework for aspirants."
  },
  {
    "date": "Thursday, 23 Oct 2025",
    "imgSrc": "/img/Day10.jpg",
    "title": "Best Books for Every Competitive Exam",
    "description": "Comprehensive list of recommended books by toppers and experts for UPSC, SSC, Banking, and other exams."
  },
  {
    "date": "Thursday, 23 Oct 2025",
    "imgSrc": "/img/Day11.jpg",
    "title": "How to Stay Motivated During Long Exam Preparation",
    "description": "Practical tips and routines to boost motivation. Focus on study habits and time management to avoid burnout."
  },
  {
    "date": "Thursday, 23 Oct 2025",
    "imgSrc": "/img/Day12.jpg",
    "title": "Daily Quiz & Practice Series — Boost Your Score and Speed",
    "description": "Improve accuracy, speed, and question selection. Learning and analytic approach to improving specific competitive exam scores."
  },
  {
    "date": "Thursday, 23 Oct 2025",
    "imgSrc": "/img/Day13.jpg",
    "title": "Revision Made Easy: How to Retain 100% of What You Study",
    "description": "Effective techniques during competitive exam preparation to ensure your hard work pays off."
  }
]
